7_future_of_ai/README.md

# Table of Contents

-   [What will you learn?](#org51adadb)
-   [Data](#org13cca80)
    -   [Definition](#orgcc83181)
    -   [Goals](#org7c6cad5)
    -   [Method](#orgfe498ac)
    -   [Output](#org60a10f1)
-   [Information](#orgb8b786e)
-   [Knowledge](#orgeda9921)
-   [Wisdom](#org3da57d2)
-   [References](#orge8b0ea3)

As always, this framework presentation will be fully equipped with
more material after the live classroom session on Oct 6, 2021.

-   Protocol anyone?
-   Whiteboard photos


<a id="org51adadb"></a>

# What will you learn?

-   Broaden the view from Andrew Ng's focus
-   Check impact of intelligent agent paradigm
-   Understand method/content/impact of [AI100 (2021)](#org9f86e7d)
-   Develop AI literacy (critical thinking)
-   Quick group exercise to check understanding OR
-   Hard philosopho-technical question to brood over


<a id="org13cca80"></a>

# Data


<a id="orgcc83181"></a>

## Definition

> "Artificial intelligence is about getting a machine to carry out
> behaviors that we think of as requiring intelligence."

"AI effect:" once a problem is solved by AI, it is no longer
considered an AI problem - e.g. "real-time navigation aids that
decide when and how to describe upcoming turns to guide you to your
destination."


<a id="org7c6cad5"></a>

## Goals

-   Impact of AI on people and societies worldwide
-   Articulate "standing questions"
-   Initiate discussion
-   Influence policy and curricular decisions


<a id="orgfe498ac"></a>

## Method

Remember common critical questions: relevance (how important is
it?) and validation (why should I trust it?)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Longitudinal study (started in 2016)</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Multi-disciplinary expert panel (p.3)<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Experts "create AI algorithms" or "study their influence on society"</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Multi-step process of linked workshops<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>

Compare: Royal Dutch Shell scenario planning process ([FFFatMIT,
2011](https://youtu.be/yVgxZnRT54E))


<a id="org60a10f1"></a>

## Output

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">70 page document</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Panel discussion videos</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">List of 12 standing questions</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Limited quantitative data 2 graphs (p.44,p.57), 1 table (p.66)</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">Illustrations through various (well-known) pictures</td>
<td class="org-left">?</td>
</tr>


<tr>
<td class="org-left">References (in footnotes) often just URLs</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>


<a id="orgb8b786e"></a>

# Information

Standing Questions (SQ):

1.  What are some Pictures that reflect important AI progress?
2.  What are the most important advances in AI?
3.  What are the most inspiring open grand challenge problems?
4.  How much have we progressed in understanding the key mysteries of
    human intelligence?
5.  What are the prospects for more general artificial intelligence?
6.  How has public sentiment towards AI evolved, and how should we
    inform/educate the public?
7.  How should governments act to ensure AI is developed and used
    responsibly?
8.  What should the roles of academia and industry be, respectively,
    in the development and deployment of AI technologies and the
    study of the impacts of AI?
9.  What are the most promising opportunities for AI?
10. What are the most pressing dangers of AI?
11. How has AI impacted socioeconomic relationships?
12. Does it appear "building in how we think" works as an
    engineering strategy in the long run?

Check some of these out for relevance to your presentation topics
(some interesting references though overall lack of quantitative
data).


<a id="orgeda9921"></a>

# Knowledge

Place SQs in scenario framework: 

-   problem vs. solution focus
-   soft (socio-political) vs. hard (mathematical-technical)

Result:

-   Soft problems: 4,5,6,10,11
-   Soft solutions: 1,7,8
-   Hard problems: 3
-   Hard solutions: 2,9,12


<a id="org3da57d2"></a>

# Wisdom

Question: What is the relationship between AI and God (if any)?

> “It’s only for me, and — but I but I personally think of my belief
> that God exists, although I have no idea what that means. But I
> believe that there is something beyond human capabilities — and it
> might be some AI, but whatever, but I do believe that there is
> something that goes beyond the realm of human understanding, that I
> can try to learn more about how to resonate with, whatever that
> being would like me to do.” [Donald Knuth (2021)](#org53f34de)

See also podcast summary ([McKendrick, 2021](#org0436ed4)).


<a id="orge8b0ea3"></a>

# References

<a id="org9f86e7d"></a> Litman et al (Sept 16, 2021). Gathering Strength,
Gathering Storms: The One Hundred Year Study on Artificial
Intelligence (AI100). 2021 Study Panel Report, Stanford U.,
CA. [Online: ai100.stanford.edu](https://ai100.stanford.edu/sites/g/files/sbiybj18871/files/media/file/AI100Report_MT_10.pdf).

<a id="org53f34de"></a> Fridman L (Sept 9, 2021). Donald Knuth: Programming,
Algorithms, Hard Problems & the Game of Life | Lex Fridman Podcast
\#219 [Podcast]. [Online: lexfridman.com](https://lexfridman.com/donald-knuth-2/).

<a id="org0436ed4"></a>> McKendrick J (Sept 18, 2021). Artificial intelligence
success is tied to ability to augment, not just automate
[Website]. [Online:zdnet.com](https://www.zdnet.com/article/artificial-intelligence-success-is-tied-to-ability-to-augment-not-just-automate/).

<a id="org7a3479f"></a> Stanford HAI (Sep 23, 2020). Andrew Ng: Bridging AI's
Proof-of-Concept to Production Gap [video]. [Online: youtube.com](https://youtu.be/tsPuVAMaADY).

Warden P (Feb 3, 2021). The Future of Machine Learning is Tiny
[Blog]. [Online: arducam.com](https://www.arducam.com/raspberry-pi-pico-tensorflow-lite-micro-person-detection-arducam/).


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> Though the authors claim that the 2nd report 2021 should broaden
the vision of AI beyond "North American cities" (2016), there are no
Standing Committee members from Continental Europe, or from
Asia. While Microsoft Research is participating, Google and Amazon are
absent.

<sup><a id="fn.2" href="#fnr.2">2</a></sup> "Two workshops were selected for funding:"
